library VirtFont;

interface

procedure ќкно_”становить;
var
   concurent: boolean;

procedure —трока(var стр_: string);
implementation

uses GraphABC;

var
   ///- режим работы шрифта
   /// 0: 8x8 точек
   режим: integer := 0;
   En_A: ARRAY [1..8] OF BYTE := (0, 112, 72, 68, 66, 66, 126, 66);
   En_B: ARRAY [1..8] OF BYTE := (0, 30, 34, 34, 66, 66, 66, 62);
   En_C: ARRAY [1..8] OF BYTE := (0, 60, 66, 2, 2, 2, 66, 60);
   En_D: ARRAY [1..8] OF BYTE := (0, 60, 66, 2, 2, 2, 66, 60);
   (*============== русский алфавит 8х8 =========================*)
   –у_јб8: ARRAY [1..8] OF BYTE := (0, 96, 80, 72, 68, 126, 66, 66);
   –у_Ѕб8: ARRAY [1..8] OF BYTE := (0, 62, 2, 2, 62, 66, 66, 62);
   –у_¬б8: ARRAY [1..8] OF BYTE := (0, 62, 66, 62, 66, 66, 66, 62);
   –у_√б8: ARRAY [1..8] OF BYTE := (0, 126, 66, 2, 2, 2, 2, 2);
   –у_ƒб8: ARRAY [1..8] OF BYTE := (0, 56, 40, 40, 40, 36, 126, 66);
   –у_≈б8: ARRAY [1..8] OF BYTE := (0, 62, 2, 30, 2, 2, 2, 62);
   –у_®б8: ARRAY [1..8] OF BYTE := (20, 62, 2, 30, 2, 2, 2, 62);
   –у_∆б8: ARRAY [1..8] OF BYTE := (0, 42, 42, 28, 28, 42, 42, 42);
   –у_«б8: ARRAY [1..8] OF BYTE := (0, 60, 66, 28, 2, 2, 66, 60);
   –у_»б8: ARRAY [1..8] OF BYTE := (0, 66, 66, 98, 82, 74, 70, 60);
   –у_…б8: ARRAY [1..8] OF BYTE := (24, 66, 66, 98, 82, 74, 70, 60);
   –у_ б8: ARRAY [1..8] OF BYTE := (0, 66, 34, 18, 14, 18, 34, 66);
   –у_Ћб8: ARRAY [1..8] OF BYTE := (0, 112, 72, 68, 68, 68, 68, 70);
   –у_ћб8: ARRAY [1..8] OF BYTE := (0, 34, 54, 42, 42, 42, 42, 42);
   –у_Ќб8: ARRAY [1..8] OF BYTE := (0, 66, 66, 66, 126, 66, 66, 66);
   –у_ќб8: ARRAY [1..8] OF BYTE := (0, 60, 66, 66, 66, 66, 66, 60);
   –у_ѕб8: ARRAY [1..8] OF BYTE := (0, 126, 66, 66, 66, 66, 66, 66);
   –у_–б8: ARRAY [1..8] OF BYTE := (0, 62, 66, 66, 62, 2, 2, 2);
   –у_—б8: ARRAY [1..8] OF BYTE := (0, 60, 66, 2, 2, 2, 66, 60);
   –у_“б8: ARRAY [1..8] OF BYTE := (0, 124, 16, 16, 16, 16, 16, 16);
   –у_”б8: ARRAY [1..8] OF BYTE := (0, 66, 66, 66, 124, 64, 66, 60);
   –у_‘б8: ARRAY [1..8] OF BYTE := (0, 56, 84, 84, 84, 84, 56, 16);
   –у_’б8: ARRAY [1..8] OF BYTE := (0, 56, 84, 84, 84, 84, 56, 16);
   –у_÷б8: ARRAY [1..8] OF BYTE := (0, 66, 36, 24, 24, 36, 66, 66);
   –у_„б8: ARRAY [1..8] OF BYTE := (0, 66, 66, 66, 124, 64, 64, 64);
   –у_Ўб8: ARRAY [1..8] OF BYTE := (0, 84, 84, 84, 84, 84, 84, 124);
   –у_ўб8: ARRAY [1..8] OF BYTE := (0, 42, 42, 42, 42, 42, 126, 64);
   –у_№б8: ARRAY [1..8] OF BYTE := (0, 2, 2, 2, 62, 66, 66, 62);
   –у_џб8: ARRAY [1..8] OF BYTE := (0, 66, 66, 66, 78, 82, 82, 78);
   –у_Џб8: ARRAY [1..8] OF BYTE := (0, 6, 4, 4, 60, 68, 68, 60);
   –у_Ёб8: ARRAY [1..8] OF BYTE := (0, 60, 66, 64, 120, 64, 66, 60);
   –у_ёб8: ARRAY [1..8] OF BYTE := (0, 50, 74, 74, 78, 74, 74, 50);
   –у_яб8: ARRAY [1..8] OF BYTE := (0, 124, 66, 66, 124, 72, 68, 66);
   ц0_8: ARRAY [1..8] OF BYTE := (0, 60, 66, 98, 82, 74, 70, 60);
   ц1_8: ARRAY [1..8] OF BYTE := (0, 32, 48, 40, 36, 32, 32, 32);
   ц2_8: ARRAY [1..8] OF BYTE := (0, 28, 34, 32, 16, 8, 4, 62);
   ц3_8: ARRAY [1..8] OF BYTE := (0, 126, 64, 56, 96, 64, 66, 60);
   ц4_8: ARRAY [1..8] OF BYTE := (0, 32, 48, 40, 36, 126, 32, 32);
   ц5_8: ARRAY [1..8] OF BYTE := (0, 126, 2, 62, 64, 64, 64, 62);
   ц6_8: ARRAY [1..8] OF BYTE := (0, 60, 2, 62, 66, 66, 66, 60);
   ц7_8: ARRAY [1..8] OF BYTE := (0, 126, 66, 32, 16, 8, 8, 8);
   ц8_8: ARRAY [1..8] OF BYTE := (0, 60, 66, 60, 66, 66, 66, 60);
   ц9_8: ARRAY [1..8] OF BYTE := (0, 60, 66, 66, 124, 64, 64, 60);
   зѕлюс_8: ARRAY [1..8] OF BYTE := (0, 0, 16, 16, 124, 16, 16, 0);
   зћинус_8: ARRAY [1..8] OF BYTE := (0, 0, 0, 0, 124, 0, 0, 0);
   з«вез_8: ARRAY [1..8] OF BYTE := (0, 0, 36, 24, 126, 24, 36, 0);
   зƒелЌиз_8: ARRAY [1..8] OF BYTE := (0, 2, 4, 8, 16, 32, 64, 0);
   зƒел¬ерт_8: ARRAY [1..8] OF BYTE := (0, 16, 16, 16, 16, 16, 16, 0);
   зƒел¬ерх_8: ARRAY [1..8] OF BYTE := (0, 64, 32, 16, 8, 4, 2, 0);
   з–авно_8: ARRAY [1..8] OF BYTE := (0, 0, 0, 126, 0, 126, 0, 0);
   зƒв“чк_8: ARRAY [1..8] OF BYTE := (0, 24, 24, 0, 0, 24, 24, 0);
   з“чк_8: ARRAY [1..8] OF BYTE := (0, 0, 0, 0, 0, 0, 24, 24);
   з«пт_8: ARRAY [1..8] OF BYTE := (0, 0, 0, 60, 60, 32, 32, 48);
   з“чк«пт_8: ARRAY [1..8] OF BYTE := (0, 60, 60, 0, 60, 60, 32, 48);
   з¬опр_8: ARRAY [1..8] OF BYTE := (0, 60, 66, 32, 16, 24, 0, 24);
   з¬оск_8: ARRAY [1..8] OF BYTE := (0, 24, 24, 24, 24, 0, 0, 24);
   з авќд_8: ARRAY [1..8] OF BYTE := (0, 24, 24, 16, 0, 0, 0, 0);
   з—к_Ћев_8: ARRAY [1..8] OF BYTE := (0, 16, 8, 8, 8, 8, 8, 16);
   з—к_ѕр_8: ARRAY [1..8] OF BYTE := (0, 8, 16, 16, 16, 16, 16, 8);
   з—к в_Ћев_8: ARRAY [1..8] OF BYTE := (0, 56, 8, 8, 8, 8, 8, 56);
   з—к в_ѕрав_8: ARRAY [1..8] OF BYTE := (0, 56, 32, 32, 32, 32, 32, 56);
   з—к‘иг_Ћев_8: ARRAY [1..8] OF BYTE := (0, 112, 8, 8, 14, 8, 8, 112);
   з—к‘иг_ѕрав_8: ARRAY [1..8] OF BYTE := (0, 14, 16, 16, 112, 14, 14, 14);
   зЅольш_8: ARRAY [1..8] OF BYTE := (0, 4, 8, 16, 32, 16, 8, 4);
   зћеньш_8: ARRAY [1..8] OF BYTE := (0, 32, 16, 8, 4, 8, 16, 32);

procedure —трока(var стр_: string);
begin
end;

procedure ќкно_”становить;
begin
   SetSmoothingOn;
   window.SetSize(640, 480);
   floodfill(1, 1, clBlack);
   window.Title := '—имвол'; 
   (*Coordinate.SetMathematic; *)
end;


begin
   ќкно_”становить;  
end.